/*
  Подготовительное задание.
  
  0. Если вы работаете с windows убедитесь, что ваш терминал полноценно поддерживает linux команды.
  Самое распространенное и проверенное решение это:
  https://git-scm.com/downloads

  Для пользователей у которых уже установлен gitbash или они пользуются mac/linux этот шаг можно пропустить.

  1. Убедитесь что установлена актуальная версия ноды в системе.

  node -v должен показать версию 10+. Последняя stable версия сейчас 14.*.*
  Так же должны быть установлены модули npm & npx версии 5.2 и выше.

  В случае, если версии пакетов устаревшие или отсутствуют в системе, рекомендую переустановить node.js любым удобным вам
  способом.
  https://nodejs.org/uk/
  npm install -g npx

  2. Нужно установить пакет Create React App (CRA) в свою систему и создать чистый проект .

  Есть два варианта используя глобальные реестр npm или npx:
  a)
    npm install -g create-react-app (Устанавливает на машину и использует фикс версию)
    
    create-react-app my-app
  b)
    npx create-react-app my-app (Устанавливает с облака последнюю версию)

  3. Установить инструменты разработчика:
  https://chrome.google.com/webstore/detail/react-developer-tools/fmkadmapgofadopljbjfkapdkoienihi?hl=ru

*/
